hrshygoodness/Luminary-Micro-Library/boards/ek-lm3s1968/qs_ek-lm3s1968/game.c
                //
                // See if the bullet has struck a wall.
                //
                if((g_pusBulletX[ulLoop] < 1524) &&
                   (g_ppcMaze[g_pusBulletY[ulLoop] / 12]
                             [g_pusBulletX[ulLoop] / 12] != 0))
                {
                    //
                    // Add an explosion at the point the bullet struck the
                    // wall.
                    //
                    AddExplosion(((g_pusBulletX[ulLoop] / 12) * 12) + 6,
                                 g_pusBulletY[ulLoop] - 6);

                    //
                    // Play the sound of the wall being struck.
                    //
                    ClassDStop();
                    ClassDPlayADPCM(g_pucWallEffect, sizeof(g_pucWallEffect));

                    //
                    // The bullet is now unfired.
                    //
                    g_pusBulletX[ulLoop] = 0;
                    g_pusBulletY[ulLoop] = 0;
                }

                //
                // Done moving this bullet.
                //
                break;
            }

            //
            // This bullet was fired right.
            //
            case 8:
            {
                //
                // Move the bullet right.
                //
                g_pusBulletX[ulLoop] += 4;

                //
                // See if the bullet has struck a wall.
                //
                if((g_pusBulletX[ulLoop] < 1521) &&
                   (g_ppcMaze[g_pusBulletY[ulLoop] / 12]
                             [(g_pusBulletX[ulLoop] + 3) / 12] != 0))
                {
                    //
                    // Add an explosion at the point the bullet struck the
                    // wall.
                    //
                    AddExplosion((((g_pusBulletX[ulLoop] - 4) / 12) * 12) + 6,
                                 g_pusBulletY[ulLoop] - 6);

                    //
                    // Play the sound of the wall being struck.
                    //
                    ClassDStop();
                    ClassDPlayADPCM(g_pucWallEffect, sizeof(g_pucWallEffect));

                    //
                    // The bullet is now unfired.
                    //
                    g_pusBulletX[ulLoop] = 0;
                    g_pusBulletY[ulLoop] = 0;
                }

                //
                // Done moving this bullet.
                //
                break;
            }
        }

        //
        // If the bullet is no longer within the maze (i.e. it was fired
        // through the maze exit) then remove it from the display and make it
        // be unfired.
        //
        if((g_pusBulletX[ulLoop] > 1524) || (g_pusBulletY[ulLoop] > 1128))
        {
            g_pusBulletX[ulLoop] = 0;
            g_pusBulletY[ulLoop] = 0;
        }

        //
        // See if this bullet needs to be drawn.
        //
        if((g_pusBulletX[ulLoop] != 0) || (g_pusBulletY[ulLoop] != 0))
        {
            //
            // Until a collision is found, assume there is no collision.
            //
            bHit = false;

            //
            // Get the position on the display where the bullet should be
            // drawn.
            //
            lX = (long)g_pusBulletX[ulLoop] - (long)g_usPlayerX + (64 - 6);
            lY = (long)g_pusBulletY[ulLoop] - (long)g_usPlayerY + (47 - 6);

            //
            // See if the bullet is completely off the display.
            //
            if((lX < -3) || (lX > 127) || (lY < -3) || (lY > 93))
            {
                //
                // Make this bullet be unfired since it is no longer on the
                // display.
                //
                g_pusBulletX[ulLoop] = 0;
                g_pusBulletY[ulLoop] = 0;
            }

            //
            // Otherwise, see if the bullet is fired vertically.
            //
            else if((g_pucBulletDir[ulLoop] & 0x03) != 0)
            {
                //
                // Loop through the four rows of the bullet.
                //
                for(ulIdx = (lY < 0) ? -lY : 0, lY = (lY < 0) ? 0 : lY;
                    (ulIdx < 4) && (lY < 94); ulIdx++, lY++)
                {
                    //
                    // See if this pixel is already set.
                    //
                    if((g_pucFrame[(lY * 64) + (lX / 2)] & 0x0f) != 0)
                    {
                        //
                        // Indicate that a collision has occurred.
                        //
                        bHit = true;
                    }

                    //
                    // Draw this pixel on the display.
                    //
                    g_pucFrame[(lY * 64) + (lX / 2)] |= 0x0f;
                }
            }

            //
            // Otherwise, the bullet is fired horizontally.
            //
            else
            {
                //
                // Loop through the four columns of the bullet.
                //
                for(ulIdx = (lX < 0) ? -lX : 0, lX = (lX < 0) ? 0 : lX;
                    (ulIdx < 2) && (lX < 128); ulIdx++, lX += 2)
                {
                    //
                    // See if either of these pixels is already set.
                    //
                    if(g_pucFrame[(lY * 64) + (lX / 2)] != 0)
                    {
                        //
                        // Indicate that a collision has occurred.
                        //
                        bHit = true;
                    }

                    //
                    // Draw these pixel on the display.
                    //
                    g_pucFrame[(lY * 64) + (lX / 2)] |= 0xff;
                }
            }

            //
            // See if a collision has occurred.
            //
            if(bHit)
            {
                //
                // Play the sound effect for a monster dying.
                //
                ClassDStop();
                ClassDPlayADPCM(g_pucMonsterEffect,
                                sizeof(g_pucMonsterEffect));

                //
                // Add one hundred points to the score.
                //
                g_ulScore += 100;

                //
                // See if this bullet was travelling vertically or horizontally
                // and determine the adjustment made to the top and left edge
                // of the monster position to account for the fact that the
                // bullet is not a single point.
                //
                if((g_pucBulletDir[ulLoop] & 0x03) != 0)
                {
                    //
                    // The bullet was travelling vertically.  Set the monster
                    // position adjust accordingly.
                    //
                    lX = 0;
                    lY = -3;
                }
                else
                {
                    //
                    // The bullet was travelling horizontally.  Set the monster
                    // position adjust accordingly.
                    //
                    lX = -3;
                    lY = 0;
                }

                //
                // Loop over all the monsters.
                //
                for(ulIdx = 0; ulIdx < 100; ulIdx++)
                {
                    //
                    // Skip this monster if it is already dead.
                    //
                    if((g_pusMonsterX[ulIdx] == 0) &&
                       (g_pusMonsterY[ulIdx] == 0))
                    {
                        continue;
                    }

                    //
                    // See if the bullet hit this monster.
                    //
                    if(((g_pusMonsterX[ulIdx] + lX) < g_pusBulletX[ulLoop]) &&
                       ((g_pusMonsterX[ulIdx] + 12) > g_pusBulletX[ulLoop]) &&
                       ((g_pusMonsterY[ulIdx] + lY) < g_pusBulletY[ulLoop]) &&
                       ((g_pusMonsterY[ulIdx] + 12) > g_pusBulletY[ulLoop]))
                    {
                        //
                        // Add an explosion at the position of the monster.
                        //
                        AddExplosion(g_pusMonsterX[ulIdx],
                                     g_pusMonsterY[ulIdx]);

                        //
                        // Indicate that this monster is now dead.
                        //
                        g_pusMonsterX[ulIdx] = 0;
                        g_pusMonsterY[ulIdx] = 0;

                        //
                        // Stop looking for monsters.
                        //
                        break;
                    }
                }

                //
                // This bullet is no longer active.
                //
                g_pusBulletX[ulLoop] = 0;
                g_pusBulletY[ulLoop] = 0;
            }
        }
    }
}

//*****************************************************************************
//
// Draws the player in the middle of the display, handling the animation of the
// player based on its motion and direction.
//
//*****************************************************************************
static tBoolean
DrawPlayer(unsigned char ucDirection)
{
    unsigned long ulLoop, ulIdx, ulNum;
    const unsigned char *pucAnimation;
    unsigned char ucData1, ucData2;
    tBoolean bBoom;

    //
    // Assume no collisions until one is found.
    //
    bBoom = false;

    //
    // See if the player is moving in the same direction as the previous time.
    //
    if(ucDirection != (g_ucDirection & 0x0f))
    {
        //
        // The player is not moving the same as before, so see if the player is
        // moving or stopped.
        //
        if(ucDirection)
        {
            //
            // The player is moving, so save the direction of motion.
            //
            g_ucDirection = ucDirection;
        }
        else
        {
            //
            // The player is stopped, so save the previous direction of motion
            // (which determines the direction that the player faces when
            // stopped).
            //
            g_ucDirection <<= 4;
        }

        //
        // Reset the animation count to zero.
        //
        g_ucCount = 0;
    }
    else
    {
        //
        // The player is moving in the same direction as before, so increment
        // the animation count.
        //
        g_ucCount++;
    }

    //
    // Determine the animation to use based on the player's direction of
    // motion.
    //
    switch(g_ucDirection)
    {
        //
        // The player is moving up.
        //
        case 0x01:
        {
            //
            // Use the animation for the player walking up.
            //
            pucAnimation = g_pucPlayerWalkingUp;
            ulNum = sizeof(g_pucPlayerWalkingUp);

            //
            // Done handling this animation.
            //
            break;
        }

        //
        // The player is moving down.
        //
        case 0x02:
        {
            //
            // Use the animation for the player walking down.
            //
            pucAnimation = g_pucPlayerWalkingDown;
            ulNum = sizeof(g_pucPlayerWalkingDown);

            //
            // Done handling this animation.
            //
            break;
        }

        //
        // The player is moving left.
        //
        case 0x04:
        {
            //
            // Use the animation for the player walking left.
            //
            pucAnimation = g_pucPlayerWalkingLeft;
            ulNum = sizeof(g_pucPlayerWalkingLeft);

            //
            // Done handling this animation.
            //
            break;
        }

        //
        // The player is moving right.
        //
        case 0x08:
        {
            //
            // Use the animation for the player walking right.
            //
            pucAnimation = g_pucPlayerWalkingRight;
            ulNum = sizeof(g_pucPlayerWalkingRight);

            //
            // Done handling this animation.
            //
            break;
        }

        //
        // The player is dying.
        //
        case 0x0f:
        {
            //
            // Use the animation sequence for the player dying.
            //
            pucAnimation = g_pucPlayerDying;
            ulNum = sizeof(g_pucPlayerDying);

            //
            // Done handling this animation.
            //
            break;
        }

        //
        // The player is standing still but previously was moving up.
        //
        case 0x10:
        {
            //
            // Use the animation for the player standing while facing up.
            //
            pucAnimation = g_pucPlayerStandingUp;
            ulNum = sizeof(g_pucPlayerStandingUp);

            //
            // Done handling this animation.
            //
            break;
        }

        //
        // The player is standing still but previously was moving down.
        //
        default:
        case 0x20:
        {
            //
            // Use the animation for the player standing while facing down.
            //
            pucAnimation = g_pucPlayerStandingDown;
            ulNum = sizeof(g_pucPlayerStandingDown);

            //
            // Done handling this animation.
            //
            break;
        }

        //
        // The player is standing still but previously was moving left.
        //
        case 0x40:
        {
            //
            // Use the animation for the player standing while facing left.
            //
            pucAnimation = g_pucPlayerStandingLeft;
            ulNum = sizeof(g_pucPlayerStandingLeft);

            //
            // Done handling this animation.
            //
            break;
        }

        //
        // The player is standing still but previously was moving right.
        //
        case 0x80:
        {
            //
            // Use the animation for the player standing while facing right.
            //
            pucAnimation = g_pucPlayerStandingRight;
            ulNum = sizeof(g_pucPlayerStandingRight);

            //
            // Done handling this animation.
            //
            break;
        }
    }

    //
    // Find the index into the animation sequence based on the current
    // animation count.
    //
    for(ulLoop = 0; ulLoop < ulNum; ulLoop += 2)
    {
        if(pucAnimation[ulLoop] > g_ucCount)
        {
            break;
        }
    }

    //
    // See if the animation sequence has been completed.
    //
    if(ulLoop == ulNum)
    {
        //
        // Reset the animation count.
        //
        g_ucCount = 0;

        //
        // Use the first image in the animation sequence.
        //
        ulIdx = pucAnimation[1];
    }
    else
    {
        //
        // Otherwise, use the most recent image in the animation sequence.
        //
        ulIdx = pucAnimation[ulLoop - 1];
    }

    //
    // Loop over the bytes of the sprite for this sequence in the animation.
    //
    for(ulLoop = 0; ulLoop < 72; ulLoop++)
    {
        //
        // Copy the sprite data into the local frame buffer and check for a
        // collision.
        //
        ucData1 = g_pucFrame[(((ulLoop / 6) + 41) * 64) + (ulLoop % 6) + 29];
        ucData2 = g_ppucSprites[ulIdx][ulLoop];
        if((ucData2 & 0xf0) != 0)
        {
            if((ucData1 & 0xf0) != 0)
            {
                bBoom = true;
            }
            ucData1 &= 0x0f;
        }
        if((ucData2 & 0x0f) != 0)
        {
            if((ucData1 & 0x0f) != 0)
            {
                bBoom = true;
            }
            ucData1 &= 0xf0;
        }
        g_pucFrame[(((ulLoop / 6) + 41) * 64) + (ulLoop % 6) + 29] =
            ucData1 | ucData2;
    }

    //
    // Return an indication of the collision detection.
    //
    return(bBoom);
}

//*****************************************************************************
//
// Draws the active explosions onto the display.
//
//*****************************************************************************
static void
DrawExplosions(void)
{
    long lX, lY, lExplosionX, lExplosionY;
    unsigned char ucData1, ucData2;
    unsigned long ulLoop, ulIdx;

    //
    // Loop through all the explosions.
    //
    for(ulLoop = 0; ulLoop < 4; ulLoop++)
    {
        //
        // Skip this explosion if it is not active.
        //
        if((g_pusExplosionX[ulLoop] == 0) && (g_pusExplosionY[ulLoop] == 0))
        {
            continue;
        }

        //
        // Increment the explosion animation count.
        //
        g_pucExplosionCount[ulLoop]++;

        //
        // Find the index into the animation sequence based on the current
        // animation count.
        //
        for(ulIdx = 0; ulIdx < sizeof(g_pucExplosion); ulIdx += 2)
        {
            if(g_pucExplosion[ulIdx] > g_pucExplosionCount[ulLoop])
            {
                break;
            }
        }

        //
        // See if the animation sequence has been completed.
        //
        if(ulIdx == sizeof(g_pucExplosion))
        {
            //
            // This explosion is done, so disable it.
            //
            g_pusExplosionX[ulLoop] = 0;
            g_pusExplosionY[ulLoop] = 0;

            //
            // Go to the next explosion.
            //
            continue;
        }
        else
        {
            //
            // Otherwise, use the most recent image in the animation sequence.
            //
            ulIdx = g_pucExplosion[ulIdx - 1];
        }

        //
        // Find the position of this explosion on the display.
        //
        lExplosionX = g_pusExplosionX[ulLoop] - (g_usPlayerX - (64 - 6));
        lExplosionY = g_pusExplosionY[ulLoop] - (g_usPlayerY - (47 - 6));

        //
        // Loop through the scan lines of this explosion.
        //
        for(lY = (lExplosionY < 0) ? -lExplosionY : 0;
            (lY < 12) && ((lExplosionY + lY) < 94); lY++)
        {
            //
            // Loop through the columns of this explosion.
            //
            for(lX = (lExplosionX < 0) ? -lExplosionX : 0;
                (lX < 12) && ((lExplosionX + lX) < 128); lX++)
            {
                //
                // Copy the sprite data into the local frame buffer.
                //
                ucData1 = g_pucFrame[((lExplosionY + lY) * 64) +
                                     ((lExplosionX + lX) / 2)];
                ucData2 = g_ppucSprites[ulIdx][(lY * 6) + (lX / 2)];
                if((ucData2 & 0xf0) != 0x00)
                {
                    ucData1 &= 0x0f;
                }
                if((ucData2 & 0x0f) != 0x00)
                {
                    ucData1 &= 0xf0;
                }
                g_pucFrame[((lExplosionY + lY) * 64) +
                           ((lExplosionX + lX) / 2)] = ucData1 | ucData2;
            }
        }
    }
}

//*****************************************************************************
//
// Draws a single number to the local frame buffer, with an optional trailing
// dot.  The mask specifies the minimum number of digits to draw (i.e. a mask
// of 100 will always draw digits for the hundreds, tens, and ones digit even
// if not required).
//
//*****************************************************************************
static unsigned long
DrawNumber(unsigned long ulStart, unsigned long ulNumber, unsigned long ulMask,
           tBoolean bDot)
{
    unsigned long ulLoop, ulIdx, ulDigit;

    //
    // Loop through the three possible digits in this number.
    //
    for(ulIdx = 1000000000; ulIdx > 0; ulIdx /= 10)
    {
        //
        // Continue if this digit should not be drawn (i.e. the hundreds digit
        // for a two digit number).
        //
        if((ulNumber < ulIdx) && (ulIdx > ulMask))
        {
            continue;
        }

        //
        // Extract this digit from the number.
        //
        ulDigit = (ulNumber / ulIdx) % 10;

        //
        // Loop over the bytes of the image for this digit.
        //
        for(ulLoop = 0; ulLoop < 52; ulLoop++)
        {
            //
            // Copy this byte of the image to the local frame buffer.
            //
            g_pucFrame[ulStart + ((ulLoop / 4) * 64) + (ulLoop % 4)] =
                g_ppucDigits[ulDigit][ulLoop];
        }

        //
        // Skip past this digit in the local frame buffer.
        //
        ulStart += 4;
    }

    //
    // See if a trailing dot should be drawn.
    //
    if(bDot)
    {
        //
        // Loop over the bytes of the image for the dot.
        //
        for(ulLoop = 0; ulLoop < 26; ulLoop++)
        {
            //
            // Copy this byte of the dot image to the local frame buffer.
            //
            g_pucFrame[ulStart + ((ulLoop / 2) * 64) + (ulLoop % 2)] =
                g_pucDot[ulLoop];
        }

        //
        // Skip past the dot in the local frame buffer.
        //
        ulStart += 2;
    }

    //
    // Return the new frame buffer starting address so that further drawing can
    // occur after the number just drawn.
    //
    return(ulStart);
}

//*****************************************************************************
//
// The main screen of the game which waits for the user to press the button to
// begin the game.  If the button is not pressed soon enough, the screen saver
// will be called instead.
//
//*****************************************************************************
tBoolean
MainScreen(void)
{
    unsigned long ulCount, ulLoop;

    //
    // Read the high score from the battery backed memory in the hibernation
    // module.  The first 3 locations are used to save the score.
    //
    HibernateDataGet(g_ulHighScore, 3);

    //
    // Validate the high score that was read from the NV memory.  The first and
    // third locations should contain certain magic numbers.  If these values
    // are not correct, then the saved high score at the second location should
    // be assumed to not be valid, and is reset to 0.
    //
    if((g_ulHighScore[0] != SCOREVALID1) || (g_ulHighScore[2] != SCOREVALID2))
    {
        g_ulHighScore[1] = 0;

