hrshygoodness/Luminary-Micro-Library/boards/ek-lm3s1968/qs_ek-lm3s1968/game.c
        //
        // The following code block is needed due to hibernation module errata.
        // When the errata is removed, this code block can be deleted.  The
        // hibernation module may have been reset, losing the high score.
        // Therefore, also check the flash to see if a high score was saved
        // there.
        //
        // Check the beginning of the high flash sector to see if appears to
        // have high score data there.  The first two locations will be marked
        // with a certain value.
        //
        if((pulFlash[0] == SCOREVALID1) && (pulFlash[1] == SCOREVALID2))
        {
            //
            // It appears high score data is stored in flash, so search the
            // last sector for the high score.
            //
            for(ulLoop = 2; ulLoop < 256; ulLoop++)
            {
                //
                // If a blank location is found, assume the remainder of the
                // block is blank and stop looking.
                //
                if(pulFlash[ulLoop] == 0xFFFFFFFF)
                {
                    break;
                }

                //
                // If there is a non-blank value here, then assume it is a
                // saved high score.  Assume the scores always increase in the
                // storage order, so the last value found is the highest.
                //
                else
                {
                    g_ulHighScore[1] = pulFlash[ulLoop];
                }
            }
        }
    }

    //
    // Generate a new maze.
    //
    GenerateMaze();

    //
    // Set the initial display position near the upper left of the maze.
    //
    g_usPlayerX = 90;
    g_usPlayerY = 90;

    //
    // Get rid of all the monsters.
    //
    for(ulLoop = 0; ulLoop < 100; ulLoop++)
    {
        g_pusMonsterX[ulLoop] = 0;
        g_pusMonsterY[ulLoop] = 0;
    }

    //
    // Loop through the number of updates to the main screen to be done before
    // the screen saver is called instead.
    //
    for(ulCount = 0; ulCount < (2 * 60 * 30); ulCount++)
    {
        //
        // Wait until an update has been requested.
        //
        while(HWREGBITW(&g_ulFlags, FLAG_UPDATE) == 0)
        {
        }

        //
        // Clear the update request flag.
        //
        HWREGBITW(&g_ulFlags, FLAG_UPDATE) = 0;

        //
        // See if the button has been pressed.
        //
        if(HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS))
        {
            //
            // Clear the button press flag.
            //
            HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS) = 0;

            //
            // Return to the caller, indicating that the game should be played.
            //
            return(true);
        }

        //
        // See if the display position is along the top of the maze.
        //
        if((g_usPlayerY == 90) && (g_usPlayerX != (1524 - 102)))
        {
            //
            // Move the display position to the right.
            //
            g_usPlayerX += 2;
        }

        //
        // Otherwise, see if the display position is along the bottom of the
        // maze.
        //
        else if((g_usPlayerY == (1128 - 102)) && (g_usPlayerX != 90))
        {
            //
            // Move the display position to the left.
            //
            g_usPlayerX -= 2;
        }

        //
        // Otherwise, see if the display position is along the right of the
        // maze.
        //
        else if(g_usPlayerX == (1524 - 102))
        {
            //
            // Move the display position down.
            //
            g_usPlayerY += 2;
        }

        //
        // Otherwise, the display position is along the left of the maze.
        //
        else
        {
            //
            // Move the display position up.
            //
            g_usPlayerY -= 2;
        }

        //
        // Clear the local frame buffer.
        //
        for(ulLoop = 0; ulLoop < sizeof(g_pucFrame); ulLoop += 4)
        {
            *((unsigned long *)(g_pucFrame + ulLoop)) = 0;
        }

        //
        // Draw the maze.
        //
        DrawMaze();

        //
        // Display the "Press Button To Play" text for sixteen frames every
        // sixteen frames, causing it to flash with a 50% duty cycle.
        //
        if(ulCount & 16)
        {
            //
            // Loop over the bytes in the image.
            //
            for(ulLoop = 0; ulLoop < (64 * 16); ulLoop++)
            {
                //
                // Copy this byte from the image to the local frame buffer.
                //
                g_pucFrame[ulLoop + (39 * 64)] = g_pucPlay[ulLoop];
            }
        }

        //
        // Display the high score message.  Loop over the bytes in the image.
        //
        for(ulLoop = 0; ulLoop < 494; ulLoop++)
        {
            g_pucFrame[(((ulLoop / 38) + 5) * 64) + (ulLoop % 38) + 0] =
                g_pucHighScore[ulLoop];
        }

        //
        // Display the high score value.
        //
        for(ulLoop = 0; ulLoop < 13; ulLoop++)
        {
            g_pucFrame[((ulLoop + 5) * 64) + 38] = 0;
        }
        DrawNumber((5 * 64) + 39, g_ulHighScore[1] % 1000000, 100000, false);

        //
        // Display the updated image on the display.
        //
        RIT128x96x4ImageDraw(g_pucFrame, 0, 0, 128, 96);
    }

    //
    // Clear out the maze.
    //
    for(ulLoop = 0; ulLoop < 94; ulLoop++)
    {
        for(ulCount = 0; ulCount < 127; ulCount++)
        {
            g_ppcMaze[ulLoop][ulCount] = 0;
        }
    }

    //
    // Move the player position to the upper left corner.
    //
    g_usPlayerX = 0;
    g_usPlayerY = 0;

    //
    // The button was not pressed so the screen saver should be invoked.
    //
    return(false);
}

//*****************************************************************************
//
// Plays the game.
//
//*****************************************************************************
void
PlayGame(void)
{
    tBoolean bAtExit, bDead, bStart, bMoveMonsters, bFire;
    unsigned long ulLoop, ulCount;

    //
    // A new maze needs to be generated.
    //
    bStart = true;

    //
    // The player is not dead yet.
    //
    bDead = false;

    //
    // The player is not at the exit yet.
    //
    bAtExit = false;

    //
    // The monsters should not be moved yet.
    //
    bMoveMonsters = false;

    //
    // The animation count defaults to zero.
    //
    ulCount = 0;

    //
    // Reset the score.
    //
    g_ulScore = 0;

    //
    // Reset the high score indicator.
    //
    g_bNewHighScore = 0;

    //
    // Play the start of game song.
    //
    ClassDStop();
    ClassDPlayADPCM(g_pucStartOfGame, sizeof(g_pucStartOfGame));

    //
    // Loop until the game is over.
    //
    while(1)
    {
        //
        // See if a new maze should be generated.
        //
        if(bStart)
        {
            //
            // Generate a new maze.
            //
            GenerateMaze();

            //
            // Set the initial player position in the middle of the maze.
            //
            g_usPlayerX = 738;
            g_usPlayerY = 558;

            //
            // The player is initially facing down.
            //
            g_ucDirection = 0;

            //
            // The player is not at the exit.
            //
            bAtExit = false;

            //
            // Choose random positions for the monsters.
            //
            for(ulLoop = 0; ulLoop < 100; ulLoop++)
            {
                //
                // Pick a random position for this monster until it is not too
                // cloose to the player's starting position.
                //
                do
                {
                    g_pusMonsterX[ulLoop] =
                        ((((RandomNumber() / 65536) * 42) / 65536) * 36) + 18;
                    g_pusMonsterY[ulLoop] =
                        ((((RandomNumber() / 65536) * 31) / 65536) * 36) + 18;
                }
                while((g_pusMonsterX[ulLoop] > (g_usPlayerX - 100)) &&
                      (g_pusMonsterX[ulLoop] < (g_usPlayerX + 100)) &&
                      (g_pusMonsterY[ulLoop] > (g_usPlayerY - 50)) &&
                      (g_pusMonsterY[ulLoop] < (g_usPlayerY + 50)));

                //
                // Pick a random offset into the monster animation for this
                // monster.
                //
                g_pucMonsterCount[ulLoop] =
                    (((RandomNumber() / 65536) *
                      g_pucMonster[sizeof(g_pucMonster) - 2]) / 65536);
            }

            //
            // The monsters should not be moved on the first update.
            //
            bMoveMonsters = false;

            //
            // Initially there are no bullets or explosions.
            //
            for(ulLoop = 0; ulLoop < 4; ulLoop++)
            {
                g_pusBulletX[ulLoop] = 0;
                g_pusBulletY[ulLoop] = 0;
                g_pusExplosionX[ulLoop] = 0;
                g_pusExplosionY[ulLoop] = 0;
            }

            //
            // A new maze no longer needs to be generated.
            //
            bStart = false;
        }

        //
        // Clear the local frame buffer.
        //
        for(ulLoop = 0; ulLoop < sizeof(g_pucFrame); ulLoop += 4)
        {
            *((unsigned long *)(g_pucFrame + ulLoop)) = 0;
        }

        //
        // See if the player is dead.
        //
        if(!bDead && !bAtExit)
        {
            //
            // See if all four direction buttons are pressed simultaneously.
            //
            if((g_ucSwitches & 0x0f) == 0)
            {
                //
                // All four direction buttons are pressed simultaneously, so
                // draw the entire maze as a cheat.
                //
                DrawCheat();
            }
            else
            {
                //
                // See if only the up button is pressed.
                //
                if((g_ucSwitches & 0x0f) == 0x0e)
                {
                    //
                    // See if there is a wall blocking the player's movement in
                    // the up direction.
                    //
                    if((g_ppcMaze[(g_usPlayerY - 2) / 12]
                                 [g_usPlayerX / 12] == 0) &&
                       (g_ppcMaze[(g_usPlayerY - 2) / 12]
                                 [(g_usPlayerX + 11) / 12] == 0))
                    {
                        //
                        // The player's movement is not blocked so move up by
                        // two positions.
                        //
                        g_usPlayerY -= 2;

                        //
                        // Increment the score since the player moved.
                        //
                        g_ulScore++;
                    }
                }

                //
                // See if only the down button is pressed.
                //
                if((g_ucSwitches & 0x0f) == 0x0d)
                {
                    //
                    // See if there is a wall blocking the player's movement in
                    // the down direction.
                    //
                    if((g_ppcMaze[(g_usPlayerY + 12) / 12]
                                 [g_usPlayerX / 12] == 0) &&
                       (g_ppcMaze[(g_usPlayerY + 12) / 12]
                                 [(g_usPlayerX + 11) / 12] == 0))
                    {
                        //
                        // The player's movement is not blocked so move down by
                        // two positions.
                        //
                        g_usPlayerY += 2;

                        //
                        // Increment the score since the player moved.
                        //
                        g_ulScore++;
                    }
                }

                //
                // See if only the left button is pressed.
                //
                if((g_ucSwitches & 0x0f) == 0x0b)
                {
                    //
                    // See if there is a wall blocking the player's movement in
                    // the left direction.
                    //
                    if((g_ppcMaze[g_usPlayerY / 12]
                                 [(g_usPlayerX - 2) / 12] == 0) &&
                       (g_ppcMaze[(g_usPlayerY + 11) / 12]
                                 [(g_usPlayerX - 2) / 12] == 0))
                    {
                        //
                        // The player's movement is not blocked so move left by
                        // two positions.
                        //
                        g_usPlayerX -= 2;

                        //
                        // Increment the score since the player moved.
                        //
                        g_ulScore++;
                    }
                }

                //
                // See if only the right button is pressed.
                //
                if((g_ucSwitches & 0x0f) == 0x07)
                {
                    //
                    // See if there is a wall blocking the player's movement in
                    // the right direction.
                    //
                    if((g_ppcMaze[g_usPlayerY / 12]
                                 [(g_usPlayerX + 12) / 12] == 0) &&
                       (g_ppcMaze[(g_usPlayerY + 11) / 12]
                                 [(g_usPlayerX + 12) / 12] == 0))
                    {
                        //
                        // The player's movement is not blocked so move right
                        // by two positions.
                        //
                        g_usPlayerX += 2;

                        //
                        // Increment the score since the player moved.
                        //
                        g_ulScore++;
                    }
                }

                //
                // See if the select button was pressed.
                //
                if(HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS))
                {
                    //
                    // Clear the button press indicator.
                    //
                    HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS) = 0;

                    //
                    // Request that a bullet be fired if possible.
                    //
                    bFire = true;
                }
                else
                {
                    //
                    // No bullet should be fired at this time.
                    //
                    bFire = false;
                }

                //
                // Move the monsters if requried.
                //
                if(bMoveMonsters)
                {
                    MoveMonsters();
                }
                bMoveMonsters = bMoveMonsters ? false : true;

                //
                // Draw the maze.
                //
                DrawMaze();

                //
                // Draw the monsters.
                //
                DrawMonsters();

                //
                // Draw the bullets.
                //
                DrawBullets(bFire);

                //
                // Draw the player.
                //
                bDead = DrawPlayer((g_ucSwitches & 0x0f) ^ 0x0f);

                //
                // Draw the explosions.
                //
                DrawExplosions();

                //
                // See if the player has reached the exit.
                //
                if((g_usPlayerX < 6) || (g_usPlayerX > 1506) ||
                   (g_usPlayerY < 6) || (g_usPlayerY > 1110))
                {
                    //
                    // The exit was reached, so add ten thousand to the score.
                    //
                    g_ulScore += 10000;

                    //
                    // Indicate that the player is at the exit and set the
                    // animation count for the exit.
                    //
                    bAtExit = true;
                    ulCount = 64;

                    //
                    // Play the completion of maze song.
                    //
                    ClassDStop();
                    ClassDPlayADPCM(g_pucEndOfMaze, sizeof(g_pucEndOfMaze));
                }

                //
                // See if the player has died.
                //
                if(bDead)
                {
                    //
                    // Play the sound effect for the player dying.
                    //
                    ClassDStop();
                    ClassDPlayADPCM(g_pucPlayerEffect,
                                    sizeof(g_pucPlayerEffect));

                    //
                    // Set the number of steps in the end of game sequence.
                    //
                    ulCount = 150;
                }
            }
        }

        //
        // Otherwise, see if the player is at the exit.
        //
        else if(bAtExit)
        {
            //
            // The player is at the exit, so flash the maze at the current
            // position.
            //
            if((ulCount % 16) > 8)
            {
                DrawMaze();
            }

            //
            // Decrement the animation count.
            //
            ulCount--;

            //
            // See if the animation count has reached zero.
            //
            if(ulCount == 0)
            {
                //
                // Request that a new maze be generated for the next update.
                //
                bStart = true;
            }
        }
        else
        {
            //
            // Check to see if this is a new high score, and if so save
            // it into the battery backed memory.  Also set two magic
            // numbers to indicate the stored data is valid.
            //
            if(g_ulScore > g_ulHighScore[1])
            {
                g_ulHighScore[1] = g_ulScore;
                g_ulHighScore[0] = SCOREVALID1;
                g_ulHighScore[2] = SCOREVALID2;
                HibernateDataSet(g_ulHighScore, 3);

                //
                // Set indicator for a new high score, so that a message
                // can be displayed later.
                //
                g_bNewHighScore = 1;

                //
                // The following code block is needed due to hibernation module
                // errata.  When the errata is removed, this code block can be
                // deleted.  The hibernation module might get reset, losing
                // the high score.  Therefore, also save the high score in
                // the last sector of flash.
                //
                // Check the beginning of the high flash sector to see if
                // high scores are already being stored there.  There will
                // be special numbers in the first two locations.  Also
                // make sure that there is at least one blank location where
                // a score can be stored.
                //
                if((pulFlash[0] != SCOREVALID1) ||
                   (pulFlash[1] != SCOREVALID2) ||
                   (pulFlash[255] != 0xFFFFFFFF))
                {
                    //
                    // Magic numbers were not found in the last sector of
                    // flash and so it is not already being used for high
                    // score.  Therefore it needs to be erased and magic
                    // numbers stored before a score can be stored there.
                    //
                    FlashErase((unsigned long)&pulFlash[0]);
                    FlashProgram(&g_ulHighScore[0],
                                 (unsigned long)&pulFlash[0], 4);
                    FlashProgram(&g_ulHighScore[2],
                                 (unsigned long)&pulFlash[1], 4);
                }

                //
                // Search for the next available blank location in the
                // flash sector, and store the high score there.
                //
                for(ulLoop = 2; ulLoop < 256; ulLoop++)
                {
                    if(pulFlash[ulLoop] == 0xFFFFFFFF)
                    {
                        FlashProgram(&g_ulHighScore[1],
                                     (unsigned long)&pulFlash[ulLoop], 4);
                        break;
                    }
                }
            }

            //
            // The player is dead, so draw the maze, monsters, and show the
            // player dying.
            //
            DrawMaze();
            DrawMonsters();
            DrawPlayer(0x0f);

            //
            // See if the player death sound effect has completed.
            //
            if(ulCount == 130)
            {
                //
                // Play the end of game song.
                //
                ClassDStop();
                ClassDPlayADPCM(g_pucEndOfGame, sizeof(g_pucEndOfGame));
            }

            //
            // Flash the "Game Over" text across the top of the display.
            //
            if((ulCount % 30) >= 15)
            {
                for(ulLoop = 0; ulLoop < 481; ulLoop++)
                {
                    g_pucFrame[(((ulLoop / 37) + 5) * 64) +
                               (ulLoop % 37) + 13] = g_pucGameOver[ulLoop];
                }
            }

            //
            // If a new high score was set, display the "New high score"
            // message.
            //
            if(g_bNewHighScore)
            {
                for(ulLoop = 0; ulLoop < 676; ulLoop++)
                {
                    g_pucFrame[(((ulLoop / 52) + 40) * 64) +
                               (ulLoop % 52) + 6] = g_pucNewHighScore[ulLoop];
                }
            }

            //
            // Display the score text across the bottom of the display.
            //
            for(ulLoop = 0; ulLoop < 286; ulLoop++)
            {
                g_pucFrame[(((ulLoop / 22) + 76) * 64) +
                           (ulLoop % 22) + 8] = g_pucScore[ulLoop];
            }
            for(ulLoop = 0; ulLoop < 13; ulLoop++)
            {
                g_pucFrame[((ulLoop + 76) * 64) + 30] = 0;
            }
            DrawNumber((76 * 64) + 31, g_ulScore % 1000000, 100000, false);

            //
            // Decrement the animation count.
            //
            ulCount--;
        }

        //
        // Wait until an update has been requested.
        //
        while(HWREGBITW(&g_ulFlags, FLAG_UPDATE) == 0)
        {
        }

        //
        // Clear the update request flag.
        //
        HWREGBITW(&g_ulFlags, FLAG_UPDATE) = 0;

        //
        // Display the updated image on the display.
        //
        RIT128x96x4ImageDraw(g_pucFrame, 0, 0, 128, 96);

        //
        // Write the current score to the UART.
        //
        UARTCharPut(UART0_BASE, '\r');
        UARTCharPut(UART0_BASE, '0' + ((g_ulScore / 100000) % 10));
        UARTCharPut(UART0_BASE, '0' + ((g_ulScore / 10000) % 10));
        UARTCharPut(UART0_BASE, '0' + ((g_ulScore / 1000) % 10));
        UARTCharPut(UART0_BASE, '0' + ((g_ulScore / 100) % 10));
        UARTCharPut(UART0_BASE, '0' + ((g_ulScore / 10) % 10));
        UARTCharPut(UART0_BASE, '0' + (g_ulScore % 10));

        //
        // See if the player is dead and the animation count has reached zero.
        //
        if(bDead && (ulCount == 0))
        {
            //
            // Exit the game.
            //
            break;
        }
    }

    //
    // Clear the button press indicator since it may still be set from the
    // player trying to fire bullets at the end of the game.
    //
    HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS) = 0;
}
